# Q1. Create a Pandas Series that contains the following data: 4, 8, 15, 16, 23, and 42. Then, print the series.

In [12]:
import pandas as pd
series = pd.Series([4,8,15,16,23,42])
print(series)

0     4
1     8
2    15
3    16
4    23
5    42
dtype: int64

# Q2. Create a variable of list type containing 10 elements in it, and apply pandas.Series function on the variable print it.

In [17]:
import pandas
lst = ['my',"name","is","burhan",2,6,0,9,9,3]
pandas.Series(lst)

0        my
1      name
2        is
3    burhan
4         2
5         6
6         0
7         9
8         9
9         3
dtype: object

# Q3. Create a Pandas DataFrame that contains the following data:

| Name  | Age | Gender | 

| Alice | 25  | Female |

| Bob   | 30  | Male   |

| Claire | 27  | Female |

In [28]:
data = [["Alice",25,"Female"],["Bob",30,"Male"],["Claire",27,"Female"]]

import pandas

df = pandas.DataFrame(data,columns=(['Name','Age','Gender']))

df

     Name  Age  Gender
0   Alice   25  Female
1     Bob   30    Male
2  Claire   27  Female

# Q4. What is ‘DataFrame’ in pandas and how is it different from pandas.series? Explain with an example.

In Pandas, a DataFrame is a two-dimensional, size-mutable, tabular data structure with labeled axes (rows and columns). It is similar to a spreadsheet or SQL table, and can be thought of as a collection of Series objects, each sharing the same index. A DataFrame can be created using various input types such as a list, dict, ndarray, or another DataFrame.

A Series, on the other hand, is a one-dimensional labeled array capable of holding any data type. It can be created using various input types such as a list, ndarray, or a scalar value.

In [13]:
import pandas as pd

# Create a dictionary of data
data = {'Name': ['burhan', 'raza', 'krish', 'naik'],
        'Age': [25, 30, 35, 40],
        'Salary': [50000, 60000, 70000, 80000]}

# Create a DataFrame from the dictionary
df = pd.DataFrame(data)

# Print the DataFrame
print(df)

# Create a Series from the 'Salary' column of the DataFrame
salary_series = df['Salary']

print("\nSeries\n")
# Print the Series
print(salary_series)

     Name  Age  Salary
0  burhan   25   50000
1    raza   30   60000
2   krish   35   70000
3    naik   40   80000

Series

0    50000
1    60000
2    70000
3    80000
Name: Salary, dtype: int64

# Q5. What are some common functions you can use to manipulate data in a Pandas DataFrame? Can you give an example of when you might use one of these functions?

Pandas offers a wide range of functions to manipulate and transform data in a DataFrame. Some of the commonly used functions are:

drop: It is used to remove rows or columns from a DataFrame based on specified labels. For example, you might want to remove certain columns from a DataFrame that are not needed for analysis.

In [15]:
import pandas as pd

# Create a DataFrame
data = {'Name': ['Burhan', 'Raza', 'Krish', 'Naik'],
        'Age': [25, 30, 35,40],
        'Salary': [50000, 60000, 70000, 80000]}
df = pd.DataFrame(data)

# Remove the 'Salary' column from the DataFrame
df = df.drop('Salary', axis=1)
df

     Name  Age
0  Burhan   25
1    Raza   30
2   Krish   35
3    Naik   40

In [11]:
# fillna: It is used to fill missing values in a DataFrame with a specified value or method. For example, you might want to replace missing values with the mean of the column.
# Replace missing values with the mean of the 'Age' column
df['Age'] = df['Age'].fillna(df['Age'].mean())
df

     Name  Age
0  Burhan   25
1    Raza   30
2   Krish   35
3    Naik   40

In [16]:
# groupby: It is used to group data in a DataFrame based on one or more columns and apply a function to each group. For example, you might want to group data by a categorical variable and calculate the mean of a numeric variable for each group.

# Group data by 'Name' and calculate the mean of the 'Age' column for each group
df.groupby('Name')['Age'].mean()

Name
Burhan    25.0
Krish     35.0
Naik      40.0
Raza      30.0
Name: Age, dtype: float64

In [18]:
# apply: It is used to apply a function to each element or row of a DataFrame. For example, you might want to apply a function that converts all values in a column to lowercase.

# Apply the str.lower() function to all values in the 'Name' column
df['Name'] = df['Name'].apply(str.lower)
df

     Name  Age
0  burhan   25
1    raza   30
2   krish   35
3    naik   40

# Q6. Which of the following is mutable in nature Series, DataFrame, Panel?

Series is a one-dimensional labeled array that can hold any data type, such as integers, strings, or floating point numbers. A DataFrame is a two-dimensional labeled data structure that consists of rows and columns, where each column can contain a different data type. A Panel is a three-dimensional labeled array that can hold heterogeneous data. 

In Pandas, both Series and DataFrame are mutable in nature. This means that their values can be changed after creation.

Panel, on the other hand, is considered a less commonly used data structure in Pandas and is typically used for three-dimensional data. It is also mutable in nature, but is used less frequently than Series and DataFrame.

# Q7. Create a DataFrame using multiple Series. Explain with an example.

In [20]:
import pandas as pd

# Create a Series for the 'Name' column
names = pd.Series(['Krish', 'Naik', 'Sudh', 'kumar'])

# Create a Series for the 'Age' column
ages = pd.Series([25, 30, 35, 40])

# Create a Series for the 'Salary' column
salaries = pd.Series([50000, 60000, 70000, 80000])

# Create a dictionary of Series
data = {'Name': names, 'Age': ages, 'Salary': salaries}

# Create a DataFrame from the dictionary of Series
df = pd.DataFrame(data)

# Print the DataFrame
print(df)

    Name  Age  Salary
0  Krish   25   50000
1   Naik   30   60000
2   Sudh   35   70000
3  kumar   40   80000